#+title: Administrative

* Automatic login
#+begin_src conf :tangle (if (eq system-type 'gnu/linux) "/sudo::/etc/systemd/system/getty@tty1.service.d/override.conf" "no") :comments no
  [Service]
  ExecStart=
  ExecStart=-/usr/bin/agetty --autologin g --noclear %I $TERM
#+end_src

* Postfix

#+begin_src shell :results replace
  tail /etc/postfix/main.cf
#+end_src

#+results:
| inet_protocols             | = | ipv4                          |
| meta_directory             | = | /etc/postfix                  |
| shlib_directory            | = | /usr/lib/postfix              |
| relayhost                  | = | [smtp.fastmail.com]:587       |
| smtp_sasl_auth_enable      | = | yes                           |
| smtp_sasl_password_maps    | = | hash:/etc/postfix/sasl_passwd |
| smtp_sasl_security_options | = | noanonymous                   |
| smtp_sasl_mechanism_filter | = | plain                         |
| smtp_use_tls               | = | yes                           |
| smtp_tls_security_level    | = | encrypt                       |

Append the following to the end of ~/etc/postfix/main.cf~

#+begin_src conf
  relayhost = [smtp.fastmail.com]:587
  smtp_sasl_auth_enable = yes
  smtp_sasl_password_maps = hash:/etc/postfix/sasl_passwd
  smtp_sasl_security_options = noanonymous
  smtp_sasl_mechanism_filter = plain
  smtp_use_tls = yes
  smtp_tls_security_level = encrypt
#+end_src

You can test the syntax of the config via the following command:

#+begin_src shell :dir /sudo:: :results replace
  sudo postfix check
#+end_src

#+results:

Create a ~/etc/postfix/sasl_passwd~ file with the following setup.

#+begin_src emacs-lisp
  (with-temp-buffer
    (insert "[smtp.fastmail.com]:"
            (auth-source-pass-get "port" "smtp.fastmail.com")
            " "
            (auth-source-pass-get "user" "smtp.fastmail.com")
            ":"
            (auth-source-pass-get 'secret "smtp.fastmail.com"))
    (format-replace-strings '(("@" . "#")))
    (write-region (point-min) (point-max) "/sudo::/etc/postfix/sasl_passwd"))
#+end_src

Then turn the password into the correct format. After running the command a file called ~sasl_passwd.db~ should be created. This means that you should be able to delete the sasl_passwd file, thus no-longer storing your password in plain text, but I have not tested this.

#+begin_src shell :dir /sudo:: :results replace
  sudo postmap /etc/postfix/sasl_passwd
#+end_src

#+results:

Then I had a lot of errors with aliases that I don't understand, but this fixes it:

#+begin_src shell :dir /sudo:: :results replace
  sudo postalias /etc/postfix/aliases
#+end_src

#+results:

For Arch, enable the systemd unit:

#+begin_src shell
  systemctl enable postfix
  systemctl start postfix
#+end_src

You can then check to see if mail is in the queue via =mailq=.
* Power button
#+begin_src conf :tangle (if (eq system-type 'gnu/linux) "/sudo::/etc/systemd/logind.conf.d/10-logind.conf" "no") :comments no
  [Login]
  HandlePowerKey=suspend
#+end_src
* Journal
#+begin_src conf  :tangle (if (eq system-type 'gnu/linux) "/sudo::/etc/systemd/journald.conf.d/00-journal-size.conf" "no") :comments no
  [Journal]
  SystemMaxUse=100M
#+end_src
* Reflector
Enable the timer via =systemctl enable reflector.timer=.

#+begin_src conf :tangle /sudo::/etc/xdg/reflector/reflector.conf :comments no
  --save /etc/pacman.d/mirrorlist
  --protocol https
  --country CA
  --country US
  --latest 25
  --age 12
  --sort rate
#+end_src
* Paccache clean

Install pacman-contrib.

#+begin_src shell :dir /sudo:: :results replace
  pacman --sync --noconfirm pacman-contrib
#+end_src

#+begin_src conf :tangle /sudo::/etc/pacman.d/hooks/clean_cache.hook
  [Trigger]
  Operation = Upgrade
  Operation = Install
  Operation = Remove
  Type = Package
  Target = *

  [Action]
  Description = Cleaning pacman cache...
  When = PostTransaction
  Exec = /usr/bin/paccache -r
#+end_src

*

* Fail lock
[[https://wiki.archlinux.org/index.php/Security#Lock_out_user_after_three_failed_login_attempts][Security - ArchWiki]]

As per =/etc/security/faillock.conf=:

- unlock_time :: the lockout time (in seconds, default 10 minutes).
- fail_interval :: the time in which failed logins can cause a lockout (in seconds, default 15 minutes).
- deny :: the number of failed logins before lockout (default 3).
- =deny = 0= will disable lockout

#+begin_src shell :dir /sudo::
  echo "deny = 0" | tee -a /etc/security/faillock.conf
#+end_src

#+results:
: deny = 0

* Set XKB for games
:LOGBOOK:
- Refiled on [2021-06-11 Fri 12:31]
:END:
[2021-06-11 Fri 12:06]

#+begin_src conf :tangle /sudo::/etc/X11/xorg.conf.d/00-keyboard.conf
  Section "InputClass"
          Identifier "keyboard defaults"
          MatchIsKeyboard "on"
          Option "XkbLayout" "us,us"
          Option "XkbVariant" ",colemak"
          Option "XkbOptions" "grp:shifts_toggle"
  EndSection
#+end_src

* Audio
:PROPERTIES:
:CREATED:  [2021-09-18 Sat 11:25]
:END:
#+begin_src conf :tangle (if *linux* "/sudo::/etc/modprobe.d/default.conf" "no") :comments no
  options snd_hda_intel index=1
#+end_src
